In [46]:
import pandas as pd
import numpy as np

In [14]:
df1 = pd.read_csv('somewhat_cleaner_datas_for_elspeth.csv')

In [15]:
df2 = pd.read_csv('even_cleaner_data(1).csv')

In [16]:
assert len(df) == len(df1)

In [17]:
len(df1)

5514

In [18]:
len(df2)

5524

In [21]:
extra_rows = df1.merge(df2, how='outer', indicator=True).query('_merge == "right_only"').drop(columns=['_merge'])

In [22]:
extra_rows # that Elspeth somehow added

       jam                                     name  n_of_words
5527   122                   Nicola Valerie Marsden           1
5528   288                           Rebecca Dobson           2
5529   288                           Jonathan Udall           3
5530   576                            Richard Dyson           2
5531   799                       Alexandru Murgeanu           2
5532   830                            Dane Chinnery           2
5533   846                           Samantha Gould           2
5534  1091                            Zainab Hashim           2
5535  1507                            Kevin Branton           2
5536  1757                            Xavier Thomas           4
5537  1757                      Christine Archibald           4
5538  1757                           James McMullan           4
5539  1757                        Alexandre Pigeard           4
5540  1757                             Kirsty Boden           4
5541  1757                       Sébastien Bélanger           4
5542  1757                             Sara Zelenak           4
5543  1757  Ignacio Echeverria Miralles de Imperial           4
5544  1757                              Khuram Butt           4
5545  1757                          Rachid Redouane           4
5546  1757                           Youssef Zaghba           4
5547  2272                        Kishorkumar Patel           2
5548  3308                             Saskia Jones           2
5549  3518                             Kenneth Daly           1
5550  3575                               Riley Holt           2
5551  3578                        Marshall Metcalfe           2
5552  3914                           Michael Draper           2
5553  4011                          Daphne Holloway           2
5554  4036                          Anthony Walgate           2
5555  4055                          William Doleman           2
5556  4245                            Emma Pattison           1
5557  4245                         Ellette Pattison           1
5558  4868                            Marcel Wochna           1
5559  4868                            Marcel Wochna           4
5560  4943                           Carole McQuinn           4
5561  5233                        Champagauri Bhatt           1

In [25]:
df3 = df2.copy()

In [26]:
df3['name_stripped'] = df3['name'].astype(str).str.strip()

In [27]:
df_deduplicated = df3.drop_duplicates(subset='name_stripped', keep='first').drop(columns=['name_stripped'])

In [29]:
df_deduplicated.to_csv('deduplicated_clean.csv', index=False)

In [37]:
df = df_deduplicated.copy()

In [40]:
df['Surname'] = df['name'].astype(str).str.strip().str.split().str[-1]

In [36]:
df.astype(str).str.strip().str.split().str[-1]

0           Malyun Karama
1       Theresa Robertson
2         George Townsend
3       Jerrelle McKenzie
4           Joan Williams
              ...
5519         Marina Young
5520          Ryan Ouslem
5521       Susan Williams
5522         Keith Weston
5523     Barbara Mitchell
Name: name, Length: 5498, dtype: object

In [41]:
df['Forename'] = df['name'].astype(str).str.strip().str.split().apply(lambda parts: ', '.join(parts[:-1]))

In [42]:
df

       jam               name  n_of_words    Surname  Forename
0        0      Malyun Karama           2     Karama    Malyun
1        1  Theresa Robertson           2  Robertson   Theresa
2        2    George Townsend           2   Townsend    George
3        3  Jerrelle McKenzie           2   McKenzie  Jerrelle
4        4      Joan Williams           2   Williams      Joan
...    ...                ...         ...        ...       ...
5519  5370       Marina Young           2      Young    Marina
5520  5371        Ryan Ouslem           2     Ouslem      Ryan
5521  5372     Susan Williams           2   Williams     Susan
5522  5373       Keith Weston           2     Weston     Keith
5523  5374   Barbara Mitchell           2   Mitchell   Barbara

[5498 rows x 5 columns]

In [43]:
df[['Forename', 'Surname']]

      Forename    Surname
0       Malyun     Karama
1      Theresa  Robertson
2       George   Townsend
3     Jerrelle   McKenzie
4         Joan   Williams
...        ...        ...
5519    Marina      Young
5520      Ryan     Ouslem
5521     Susan   Williams
5522     Keith     Weston
5523   Barbara   Mitchell

[5498 rows x 2 columns]

In [47]:
# Generate 7-digit unique numbers and prefix with "687" to form a 10-digit ID
prefix = "687"
num_required = len(df)

# Ensure no collisions
np.random.seed(0)
suffixes = np.random.choice(range(1000000, 9999999), size=num_required, replace=False)
df['Unique Identifier'] = [prefix + str(suffix).zfill(7) for suffix in suffixes]

In [50]:
df[['Unique Identifier','Forename', 'Surname']].to_csv('pfd_onno_times.csv', index=False)